app/Models/Latihanmodel.php

SELECT *
FROM `jenis_soal`
WHERE `status_cd` = 'normal'
---
    public function getJenisSoal() {
        return $this->db->table('jenis_soal')
                        ->select('*')
                        ->where('status_cd','normal')
                        ->get();