app/Models/Soalmodel.php

SELECT *
FROM `materi`
WHERE `status_cd` = 'normal'
AND `materi_nm` IN ('Sikap Kerja')
---
    public function getMateriSK() {
        return $this->db->table('materi')
                        ->select('*')
                        ->where('status_cd','normal')
                        ->whereIn('materi_nm',["Sikap Kerja"])
                        ->get();