app/Models/Usersmodel.php

    public function checklogin($u,$p) {
        return $this->db->table('users')
                        ->where('user_nm', $u)
                        ->where('pwd0',$p)
                        ->get();
---
SELECT *
FROM `users`
WHERE `user_nm` = 'uba'
AND `pwd0` = 'e10adc3949ba59abbe56e057f20f883e'

    public function getMaxSessionUser($user_id) {
        return $this->db->table('session_soal')
                        ->select('session_soal_nm')
                        ->where('user_id',$user_id)
                        ->orderby('session_soal_id','desc')
                        ->limit(1)
                        ->get();
---
SELECT `session_soal_nm`
FROM `session_soal`
WHERE `user_id` = '2'
ORDER BY `session_soal_id` DESC
 LIMIT 1

    public function simpanSessionUser($data) {
        $this->db->table('session_soal')
                 ->insert($data);
---
INSERT INTO `session_soal` (`session_soal_nm`, `user_id`, `created_dttm`) VALUES (10, '2', '2023-05-14 08:16:15')